{
  "characters": {
    "archetypes": [
      {
        "name": "The Rebel",
        "motivation": "to overturn the establishment",
        "flaw": "recklessness",
        "tags": ["chaos", "freedom", "revolution"],
        "catalyst_questions": [
          "What injustice did they witness that they can no longer ignore?",
          "Who is the one person that could calm their revolutionary fire?",
          "What symbol of the establishment do they despise the most?"
        ]
      },
      {
        "name": "The Mentor",
        "motivation": "to prepare a successor for a coming trial",
        "flaw": "a dark secret from their past",
        "tags": ["wisdom", "sacrifice", "guidance"],
        "catalyst_questions": [
          "Why can't they face the coming trial themselves?",
          "What was their greatest failure, and how does it haunt them?",
          "What is the one lesson their student refuses to learn?"
        ]
      },
      {
        "name": "The Explorer",
        "motivation": "to map the unknown and discover a hidden truth",
        "flaw": "an obsession that blinds them to danger",
        "tags": ["discovery", "curiosity", "danger"],
        "catalyst_questions": [
          "What legend or rumor are they chasing?",
          "Who told them their quest was impossible, and why must they prove them wrong?",
          "What personal connection do they have to the place they seek?"
        ]
      },
      {
        "name": "The Outcast",
        "motivation": "to find a place where they finally belong",
        "flaw": "a deep-seated mistrust of others",
        "tags": ["loneliness", "redemption", "acceptance"],
        "catalyst_questions": [
          "What crime were they unjustly accused of?",
          "Why do they believe they are unworthy of companionship?",
          "What is the one thing they carry that reminds them of the home they lost?"
        ]
      }
    ]
  },
  "conflicts": {
    "external": [
      {
        "text": "a powerful corporation that controls society's resources",
        "tags": ["oppression", "control", "dystopian"]
      },
      {
        "text": "an ancient, forgotten curse that is reawakening",
        "tags": ["supernatural", "doom", "ancient-evil"]
      },
      {
        "text": "a society on the brink of a devastating civil war",
        "tags": ["politics", "betrayal", "war"]
      }
    ]
  },
  "settings": {
    "locations": [
      {
        "name": "a neon-drenched cyberpunk metropolis",
        "sensory_palette": {
          "sight": "Flickering holographic ads, acid rain on chrome streets, augmented reality graffiti.",
          "sound": "The constant hum of flying vehicles, distant sirens, the chatter of a dozen languages.",
          "smell": "Ozone, wet pavement, and synthetic street food."
        },
        "tags": ["dystopian", "technology", "urban"]
      },
      {
        "name": "a crumbling gothic city shrouded in perpetual fog",
        "sensory_palette": {
          "sight": "Towering, gargoyle-laden spires disappearing into the mist, gas lamps casting long shadows.",
          "sound": "The distant toll of a cathedral bell, the scuttling of unseen things in alleyways.",
          "smell": "Damp stone, coal smoke, and the faint scent of decay."
        },
        "tags": ["gothic", "mystery", "supernatural"]
      },
      {
        "name": "a vast, sun-scorched desert littered with the bones of forgotten giants",
        "sensory_palette": {
          "sight": "Endless waves of sand, a heat-shimmering horizon, colossal skeletons half-buried in the dunes.",
          "sound": "The whisper of the wind, the cry of a lone hawk, an unnerving silence.",
          "smell": "Hot sand, dry air, and ancient dust."
        },
        "tags": ["fantasy", "desolation", "ancient"]
      }
    ]
  }
}
